### Importing Libraries.

In [1]:
import pandas as pd
import numpy as np

In [2]:
sal_df=pd.read_csv("Data//Salaries.csv")
sal_df.head()

C:\Users\User\AppData\Local\Temp\ipykernel_5176\3163423542.py:1: DtypeWarning: Columns (3,4,5,6,12) have mixed types. Specify dtype option on import or set low_memory=False.
  sal_df=pd.read_csv("Data//Salaries.csv")

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

### Q1) Display top 10 rows in dataset.

In [3]:
sal_df.head(10)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN
5,6,DAVID SULLIVAN,ASSISTANT DEPUTY CHIEF II,118602.0,8601.0,189082.74,NaN,316285.74,316285.74,2011,NaN,San Francisco,NaN
6,7,ALSON LEE,"BATTALION CHIEF, (FIRE DEPARTMENT)",92492.01,89062.9,134426.14,NaN,315981.05,315981.05,2011,NaN,San Francisco,NaN
7,8,DAVID KUSHNER,DEPUTY DIRECTOR OF INVESTMENTS,256576.96,0.0,51322.5,NaN,307899.46,307899.46,2011,NaN,San Francisco,NaN
8,9,MICHAEL MORRIS,"BATTALION CHIEF, (FIRE DEPARTMENT)",176932.64,86362.68,40132.23,NaN,303427.55,303427.55,2011,NaN,San Francisco,NaN
9,10,JOANNE HAYES-WHITE,"CHIEF OF DEPARTMENT, (FIRE DEPARTMENT)",285262.0,0.0,17115.73,NaN,302377.73,302377.73,2011,NaN,San Francisco,NaN

### Q2) Display last 10 rows in dataset.

In [4]:
sal_df.tail(10)

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148644,148645,Randy D Winn,"Stationary Eng, Sewage Plant",0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148645,148646,Carolyn A Wilson,Human Services Technician,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148646,148647,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148647,148648,Joann Anderson,Communications Dispatcher 2,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148648,148649,Leon Walker,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

### Q3) find the shape of our dataset.

In [5]:
print("Number of rows in dataset=",sal_df.shape[0])
print("Number of columns in dataset=",sal_df.shape[1])

Number of rows in dataset= 148654
Number of columns in dataset= 13

### Q4) Find the oiverall information about dataset like number of rows and columns datatype and memroy accupy by dataset.

In [6]:
sal_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148049 non-null  object
 4   OvertimePay       148654 non-null  object
 5   OtherPay          148654 non-null  object
 6   Benefits          112495 non-null  object
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            38119 non-null   object
dtypes: float64(3), int64(2), object(8)
memory usage: 14.7+ MB

### 4) Check the null values in dataset.

In [7]:
sal_df.isnull().sum()

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                605
OvertimePay              0
OtherPay                 0
Benefits             36159
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              110535
dtype: int64

### Q5) Drop Id,Notes,Agency and Status column from dataset.

In [8]:
sal_df.drop(['Id','Notes','Agency','Status'],axis=1,inplace=True)

In [9]:
sal_df.head()

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
0,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011
1,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011
2,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.6,NaN,335279.91,335279.91,2011
3,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.0,56120.71,198306.9,NaN,332343.61,332343.61,2011
4,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.6,9737.0,182234.59,NaN,326373.19,326373.19,2011

### Q6) Get overall statistics about dataset.

In [10]:
### It's shows only statistics about numerical columns.
sal_df.describe()

            TotalPay  TotalPayBenefits           Year
count  148654.000000     148654.000000  148654.000000
mean    74768.321972      93692.554811    2012.522643
std     50517.005274      62793.533483       1.117538
min      -618.130000       -618.130000    2011.000000
25%     36168.995000      44065.650000    2012.000000
50%     71426.610000      92404.090000    2013.000000
75%    105839.135000     132876.450000    2014.000000
max    567595.430000     567595.430000    2014.000000

In [11]:
### It's shows only statistics about all numerical and categorical columns.
sal_df.describe(include='all')

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
count,148654,148654,148049.0,148654.0,148654.0,112495.0,148654.000000,148654.000000,148654.000000
unique,110811,2159,109900.0,66555.0,84968.0,99635.0,NaN,NaN,NaN
top,Kevin Lee,Transit Operator,0.0,0.0,0.0,0.0,NaN,NaN,NaN
freq,13,7036,875.0,66103.0,35218.0,1053.0,NaN,NaN,NaN
mean,NaN,NaN,NaN,NaN,NaN,NaN,74768.321972,93692.554811,2012.522643
std,NaN,NaN,NaN,NaN,NaN,NaN,50517.005274,62793.533483,1.117538
min,NaN,NaN,NaN,NaN,NaN,NaN,-618.130000,-618.130000,2011.000000
25%,NaN,NaN,NaN,NaN,NaN,NaN,36168.995000,44065.650000,2012.000000
50%,NaN,NaN,NaN,NaN,NaN,NaN,71426.610000,92404.090000,2013.000000
75%,NaN,NaN,NaN,NaN,NaN,NaN,105839.135000,132876.450000,2014.000000
max,NaN,NaN,NaN,NaN,NaN,NaN,567595.430000,567595.430000,2014.000000

### Q7) Find the top 5 most occurance of employee name in dataset.

In [12]:
sal_df['EmployeeName'].value_counts().head(5)

Kevin Lee       13
Richard Lee     11
Steven Lee      11
William Wong    11
Stanley Lee      9
Name: EmployeeName, dtype: int64

### Q8) Find the number of unique job titles.

In [13]:
sal_df['JobTitle'].unique()

array(['GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY',
       'CAPTAIN III (POLICE DEPARTMENT)',
       'WIRE ROPE CABLE MAINTENANCE MECHANIC', ..., 'Conversion',
       'Cashier 3', 'Not provided'], dtype=object)

In [14]:
sal_df['JobTitle'].nunique()

2159

### Q9) Find the total number of job contain Captain.

In [15]:
print("NUmber of JOb conatin title as captain is =",len(sal_df[sal_df['JobTitle'].str.contains('Captain',case=False)]))

NUmber of JOb conatin title as captain is = 552

### Q10 ) Display all employees name from fire departments only.

In [16]:
sal_df[sal_df['JobTitle'].str.contains('fire',case=False)]['EmployeeName']

4            PATRICK GARDNER
6                  ALSON LEE
8             MICHAEL MORRIS
9         JOANNE HAYES-WHITE
10             ARTHUR KENNEY
                 ...
145956      Kenneth C Farris
147556         Edward A Dunn
148021        Kari A Johnson
148209          Sheryl K Lee
148554       Lawrence F Gatt
Name: EmployeeName, Length: 5879, dtype: object

### Q11) Find the minimum,maximum and average base pay.

In [17]:
sal_df.describe()

            TotalPay  TotalPayBenefits           Year
count  148654.000000     148654.000000  148654.000000
mean    74768.321972      93692.554811    2012.522643
std     50517.005274      62793.533483       1.117538
min      -618.130000       -618.130000    2011.000000
25%     36168.995000      44065.650000    2012.000000
50%     71426.610000      92404.090000    2013.000000
75%    105839.135000     132876.450000    2014.000000
max    567595.430000     567595.430000    2014.000000

### Q12) Display Not provided in Employee name columns to NaN.

In [18]:
sal_df['EmployeeName']=sal_df['EmployeeName'].str.replace('Not provided','NaN')

In [19]:
sal_df['EmployeeName']

0            NATHANIEL FORD
1              GARY JIMENEZ
2            ALBERT PARDINI
3         CHRISTOPHER CHONG
4           PATRICK GARDNER
                ...
148649        Roy I Tillery
148650                  NaN
148651                  NaN
148652                  NaN
148653            Joe Lopez
Name: EmployeeName, Length: 148654, dtype: object

### Q13) Drop the rows having 5 missing values.

In [20]:
sal_df.drop(sal_df[sal_df.isnull().sum(axis=1)==1].index,axis=0,inplace=True)

In [21]:
sal_df.isnull().sum()

EmployeeName        0
JobTitle            0
BasePay             0
OvertimePay         0
OtherPay            0
Benefits            0
TotalPay            0
TotalPayBenefits    0
Year                0
dtype: int64

In [22]:
sal_df.shape

(111890, 9)

### Q14) Find the job title of ALBERT PARDINI.

In [23]:
sal_df[sal_df['EmployeeName']=='Leon Walker']['JobTitle']

63763     Custodian
148648    Custodian
Name: JobTitle, dtype: object

In [24]:
'ALBERT PARDINI' in sal_df['EmployeeName']

False

### Q15) How much Leon Walker make Include benefits.

In [25]:
sal_df[sal_df['EmployeeName']=='Leon Walker']['TotalPayBenefits'].sum()

51417.73

In [39]:
sal_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 111890 entries, 36159 to 148653
Data columns (total 9 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   EmployeeName      111890 non-null  object
 1   JobTitle          111890 non-null  object
 2   BasePay           111890 non-null  object
 3   OvertimePay       111890 non-null  object
 4   OtherPay          111890 non-null  object
 5   Benefits          111890 non-null  object
 6   TotalPay          111890 non-null  float64
 7   TotalPayBenefits  111890 non-null  float64
 8   Year              111890 non-null  int64
dtypes: float64(2), int64(1), object(6)
memory usage: 8.5+ MB

### Q16) Find the average base pay of all employee per year.

In [41]:
sal_df.groupby('Year')['TotalPay'].mean()

Year
2012    74113.262265
2013    78808.285041
2014    75463.918140
Name: TotalPay, dtype: float64

### Q17) Find the average base pay of all employee per job title.

In [43]:
sal_df.groupby('JobTitle')['TotalPay'].mean()

JobTitle
ACPO,JuvP, Juv Prob (SFERS)        62290.780000
ASR Senior Office Specialist       63519.363167
ASR-Office Assistant               41511.501951
Account Clerk                      43145.753774
Accountant I                       62036.101250
                                      ...
Wire Rope Cable Maint Sprv        203033.720000
Worker's Comp Supervisor 1         70389.297143
Worker's Compensation Adjuster     73249.269865
X-Ray Laboratory Aide              50823.942700
Youth Comm Advisor                 41414.307500
Name: TotalPay, Length: 1110, dtype: float64

In [49]:
sal_df['BasePay'] = sal_df['BasePay'].replace(' ', np.nan)

In [46]:
sal_df.head()

,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year
36159,Gary Altenberg,"Lieutenant, Fire Suppression",128808.87,220909.48,13126.31,44430.12,362844.66,407274.78,2012
36160,Gregory Suhr,Chief of Police,302578.0,0.0,18974.11,69810.19,321552.11,391362.30,2012
36161,Khoa Trinh,Electronic Maintenance Tech,111921.0,146415.32,78057.41,53102.29,336393.73,389496.02,2012
36162,Joanne Hayes-White,"Chief, Fire Department",296943.01,0.0,17816.59,72047.88,314759.60,386807.48,2012
36163,Frederick Binkley,EMT/Paramedic/Firefighter,126863.19,192424.49,17917.18,44438.25,337204.86,381643.11,2012

In [53]:
print(sal_df['BasePay'].dtypes)

object

In [61]:
sal_df['BasePay']=sal_df['BasePay'].str.replace('Not Provided','0')

In [63]:
sal_df['BasePay']=sal_df['BasePay'].astype(float)

In [69]:
sal_df['BasePay'].fillna(sal_df['BasePay'].mean(),inplace=True)

In [70]:
sal_df[sal_df['EmployeeName']=='Leon Walker']['BasePay'].sum()

29219.866677852347

### Q18) Find the average base pay of all employee per job title.

In [71]:
sal_df.groupby('JobTitle')['BasePay'].mean()

JobTitle
ACPO,JuvP, Juv Prob (SFERS)       62290.780000
ASR Senior Office Specialist      31150.669510
ASR-Office Assistant              34799.192771
Account Clerk                     31967.999353
Accountant I                      28057.287093
                                      ...
Wire Rope Cable Maint Sprv        29219.866678
Worker's Comp Supervisor 1        30116.116198
Worker's Compensation Adjuster    29733.764695
X-Ray Laboratory Aide             30283.907709
Youth Comm Advisor                30019.255008
Name: BasePay, Length: 1110, dtype: float64

### Q19) Find the average basepay of employee having job title is Accountant.

In [73]:
sal_df[sal_df['JobTitle']=='Accountant']

Empty DataFrame
Columns: [EmployeeName, JobTitle, BasePay, OvertimePay, OtherPay, Benefits, TotalPay, TotalPayBenefits, Year]
Index: []

In [77]:
sal_df[sal_df['JobTitle'].str.contains('Accountant')]['BasePay'].mean()

30144.384535635683

### Q20) Find most common job.

In [79]:
sal_df['JobTitle'].value_counts().head(5)

Transit Operator                6975
Special Nurse                   4382
Registered Nurse                3725
Public Svc Aide-Public Works    2514
Police Officer 3                2411
Name: JobTitle, dtype: int64